{
  "backend/main.mo": "Defines core actor with user, job, application, chat, rating, and notification types and storage plus login and access control setup.",
  "feature_evidence.json": "Lists feature evidence linking UI changes to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of key frontend files including components, pages, hooks, and configuration.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app routing, authentication flow, profile setup handling, and portal selection based on user type.",
  "frontend/src/components/candidate/CandidateProfileTab.tsx": "Candidate profile view/edit screen supporting department selection, CV upload, and profile updates.",
  "frontend/src/components/candidate/ChatTab.tsx": "Messaging interface that lists conversation partners, displays chat history, and sends new messages.",
  "frontend/src/components/candidate/EmployersTab.tsx": "Placeholder employer directory card indicating the feature is coming soon.",
  "frontend/src/components/candidate/JobSearchTab.tsx": "Job search UI with filtering, job details display, and application submission via dialog.",
  "frontend/src/components/employer/CandidateSearchTab.tsx": "Employer tool to search candidates by department and location and display result cards.",
  "frontend/src/components/employer/EmployerChatTab.tsx": "Renders employer chat UI, listing conversation partners, showing messages, and allowing sending new messages via hooks.",
  "frontend/src/components/employer/EmployerProfileTab.tsx": "Displays and edits employer profile fields, loading data from hooks and submitting updates.",
  "frontend/src/components/employer/JobManagementTab.tsx": "Manages employer job postings including creation, editing, deletion, and viewing applications.",
  "frontend/src/components/Footer.tsx": "Footer with branding, smooth-scroll quick links, contact details, and social icons.",
  "frontend/src/components/Header.tsx": "Header with branding, navigation, smooth scrolling, and authenticated user menu without a login button.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating either candidate or employer profiles, handling form inputs, CV upload, and registration calls.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp button that appears after a delay and opens a predefined chat link.",
  "frontend/src/constants/contact.ts": "Exports a constant containing phone, WhatsApp, email, and location contact info.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, stored identity loading, and context state management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for login, profiles, jobs, applications, chat messages, and other backend interactions using the actor.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme variables for light and dark modes, and custom styles including a WhatsApp floating button with animations and responsive behavior.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/AdminPortal.tsx": "Admin dashboard displaying analytics, candidate/employer/job tables, and deletion/export tools with authentication and admin checks.",
  "frontend/src/pages/CandidatePortal.tsx": "Tabbed candidate portal for job search, employer browsing, chat, and profile management.",
  "frontend/src/pages/EmployerPortal.tsx": "Tabbed employer portal for job management, candidate search, chat, and profile settings.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page listing services for different user groups with login and onboarding actions.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page outlining data collection, usage, and security practices.",
  "frontend/src/pages/ServicesPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/TermsOfServicePage.tsx": "React page rendering the Terms of Service with sections on accounts, acceptable use, and job features using card components and styling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file listing schema info, existing features, pending feature requests, and meta details for build planning."
}