{
  "backend/main.mo": "Motoko backend actor defining user, candidate, employer, job, application, chat, rating, and notification types with login, access control, and initial profile setup logic.",
  "feature_evidence.json": "Feature evidence report listing UI requirements related to social icon cleanup and associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of all major frontend components, pages, hooks, and styles.",
  "frontend/index.html": "Base HTML file that loads the React application by mounting the root element and importing main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring authentication, routing, portals, global layout, and profile setup logic with TanStack Router.",
  "frontend/src/components/candidate/CandidateProfileTab.tsx": "Candidate profile viewer/editor supporting updates, CV upload, and listing application statuses.",
  "frontend/src/components/candidate/ChatTab.tsx": "Messaging interface that lists conversations, displays messages, and allows sending new messages to selected users.",
  "frontend/src/components/candidate/EmployersTab.tsx": "Placeholder employer directory card indicating the feature is coming soon.",
  "frontend/src/components/candidate/JobSearchTab.tsx": "Job search interface with filtering, job listing display, and application flow using stored candidate CV.",
  "frontend/src/components/employer/CandidateSearchTab.tsx": "Employer tool to search candidates by department and location and display matching candidate profiles.",
  "frontend/src/components/employer/EmployerChatTab.tsx": "Implements employer messaging UI that loads conversations, displays partner lists, shows messages, and allows sending new messages.",
  "frontend/src/components/employer/EmployerProfileTab.tsx": "Displays and edits employer profile data using form fields, with loading, editing state, and update submission.",
  "frontend/src/components/employer/JobManagementTab.tsx": "Provides job CRUD UI for employers, including create/edit dialogs, department selection, and application viewing logic.",
  "frontend/src/components/Footer.tsx": "Footer component with branding, quick links, contact info, and the sole social media section using SOCIAL_LINKS.",
  "frontend/src/components/Header.tsx": "Header component handling navigation, smooth scrolling, mobile menu, authenticated user menu, and branding.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial profile creation, handling candidate and employer fields, CV upload, and registration via API hooks.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp contact button that becomes visible after a delay and opens a predefined chat link.",
  "frontend/src/constants/contact.ts": "Exports static contact information including phone, WhatsApp, email, and location.",
  "frontend/src/constants/socialLinks.ts": "Defines an array of social media link configs with URLs, icons, labels, and behavior types.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity login, logout, identity state, and initializes AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for login, user, candidate, and employer profile operations using an ICP actor.",
  "frontend/src/index.css": "Configures Tailwind base styles with light/dark theme variables and custom WhatsApp floating button animations.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AboutPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/AdminPortal.tsx": "Admin dashboard with authentication checks, analytics, user/job management, and delete/export actions.",
  "frontend/src/pages/CandidatePortal.tsx": "Candidate portal with tabbed navigation for jobs, employers, chat, and profile sections.",
  "frontend/src/pages/EmployerPortal.tsx": "Employer portal with tabbed navigation for job management, candidate search, chat, and profile.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page showing service categories and login/start actions for different user types.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "React page rendering the Privacy Policy with sections describing data collection, usage, and security.",
  "frontend/src/pages/ServicesPage.tsx": "Empty or placeholder Services page with no implemented content.",
  "frontend/src/pages/TermsOfServicePage.tsx": "React page displaying Terms of Service with sections covering user accounts, acceptable use, and platform rules.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, containers, and enabling plugins like typography and container queries.",
  "project_state.json": "Metadata file describing project state, features, and new feature requests for social icon behavior and UI cleanup."
}