{
  "backend/main.mo": "Defines core actor logic for user profiles, jobs, applications, messaging, ratings, notifications, and login/setup workflow with access control and approval state.",
  "feature_evidence.json": "Feature evidence report describing a frontend-wide phone number replacement and listing affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains autogenerated summaries of key frontend components, pages, hooks, and configuration files.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app routing, authentication, profile setup handling, and portal selection logic with global WhatsApp button and layout components.",
  "frontend/src/components/candidate/CandidateProfileTab.tsx": "Candidate profile view and editor with fields, CV upload, and application status display.",
  "frontend/src/components/candidate/ChatTab.tsx": "Messaging interface allowing candidates to view conversations and send messages to employers.",
  "frontend/src/components/candidate/EmployersTab.tsx": "Placeholder employer directory card indicating the feature is coming soon.",
  "frontend/src/components/candidate/JobSearchTab.tsx": "Job search UI with filtering, job listings, and an application flow including CV submission.",
  "frontend/src/components/employer/CandidateSearchTab.tsx": "Employer tool to search candidates by department and location and view matching profiles.",
  "frontend/src/components/employer/EmployerChatTab.tsx": "Provides a messaging UI for employers to view conversation partners, select a user, read messages, and send new messages.",
  "frontend/src/components/employer/EmployerProfileTab.tsx": "Displays and edits an employer’s profile with fields for company details and contact information.",
  "frontend/src/components/employer/JobManagementTab.tsx": "Allows employers to create, edit, delete, and view applications for their job postings.",
  "frontend/src/components/Footer.tsx": "Footer component showing branding, navigation links, and contact info using CONTACT constants plus social links.",
  "frontend/src/components/Header.tsx": "Header with branding, login/logout flow, navigation, admin access, mobile menu, and profile dropdown rendering based on user state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial candidate or employer profile setup with form fields, CV upload, and registration submission.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp contact button that appears after a delay and opens a predefined chat link.",
  "frontend/src/constants/contact.ts": "Exports centralized contact information including phone, WhatsApp, email, and location.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, creation of AuthClient, and provides login/logout utilities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend functions such as login, profiles, jobs, applications, messages, and ratings.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables for light/dark mode, and custom styles including a floating WhatsApp button with animations and responsive tweaks.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering.",
  "frontend/src/pages/AboutPage.tsx": "Empty page placeholder with no implemented content.",
  "frontend/src/pages/AdminPortal.tsx": "Implements an admin dashboard with authentication checks, data fetching, tabbed views, and admin actions such as deleting records and exporting analytics.",
  "frontend/src/pages/CandidatePortal.tsx": "Provides a tabbed interface for candidates to browse jobs, employers, chats, and profile details.",
  "frontend/src/pages/EmployerPortal.tsx": "Provides a tabbed interface for employers to manage jobs, search candidates, chat, and edit their profile.",
  "frontend/src/pages/LandingPage.tsx": "Renders the marketing landing page with service categories and login flows for candidates and employers.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the site’s privacy policy using styled cards outlining data collection, usage, and security practices.",
  "frontend/src/pages/ServicesPage.tsx": "Empty page placeholder with no implemented content.",
  "frontend/src/pages/TermsOfServicePage.tsx": "React page rendering the Terms of Service with multiple sections using Card components and static text content.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "JSON file describing project metadata, feature history, and a pending request to update phone numbers across the frontend."
}