{
  "backend/main.mo": "Defines actor with profile, job, application, messaging, rating, and notification types plus login and access control logic using multiple maps for storage.",
  "feature_evidence.json": "Empty feature evidence report structure for tracking implemented features.",
  "frontend-file-summaries.txt": "Lists prewritten summaries for all major frontend components, pages, hooks, styles, and configuration files.",
  "frontend/index.html": "Basic HTML entry point mounting the root React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app managing routing, identity login flow, user setup, and conditional portals with global layout elements.",
  "frontend/src/components/candidate/CandidateProfileTab.tsx": "Displays and edits the candidate’s profile, including CV upload, department selection, and profile update handling.",
  "frontend/src/components/candidate/ChatTab.tsx": "Messaging interface showing conversation partners and chat messages with ability to send new messages.",
  "frontend/src/components/candidate/EmployersTab.tsx": "Placeholder employer directory card indicating the feature is coming soon.",
  "frontend/src/components/candidate/JobSearchTab.tsx": "Job search UI with filtering, job details display, and job application flow using the user's CV.",
  "frontend/src/components/employer/CandidateSearchTab.tsx": "Employer tool for searching candidates by department and location and displaying matching profiles.",
  "frontend/src/components/employer/EmployerChatTab.tsx": "Provides a chat UI for employers to view conversation partners, select a user, display messages, and send new messages.",
  "frontend/src/components/employer/EmployerProfileTab.tsx": "Displays and edits employer profile fields such as company info, with save and loading states.",
  "frontend/src/components/employer/JobManagementTab.tsx": "Manages employer job postings including creation, editing, deletion, and viewing applications.",
  "frontend/src/components/Footer.tsx": "Footer component showing branding, smooth-scroll links, contact info, and social icons.",
  "frontend/src/components/Header.tsx": "Header handling login/logout, navigation, user menu, admin access, and mobile menu with site branding.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating candidate or employer profiles with form fields, file upload, and registration logic.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp contact button that appears after a delay and opens a predefined chat link.",
  "frontend/src/constants/contact.ts": "Defines static contact information including phone, WhatsApp, email, and location.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages an authenticated or anonymous actor instance and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for login, user profiles, candidate/employer actions, jobs, applications, messages, and notifications.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables for light/dark mode, global styles, and animations for a floating WhatsApp button.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Empty placeholder file for the About page.",
  "frontend/src/pages/AdminPortal.tsx": "Implements an admin interface with authentication, analytics, profile/job management, and delete/export actions.",
  "frontend/src/pages/CandidatePortal.tsx": "Renders candidate tabs for job search, employers, chat, and profile management.",
  "frontend/src/pages/EmployerPortal.tsx": "Provides employer tabs for job management, candidate search, chat, and profile settings.",
  "frontend/src/pages/LandingPage.tsx": "Displays marketing content, service categories, and login flows for candidates and employers.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Shows the platform’s privacy policy with sections on data collection, usage, and security.",
  "frontend/src/pages/ServicesPage.tsx": "Empty placeholder file for the Services page.",
  "frontend/src/pages/TermsOfServicePage.tsx": "React page rendering the Terms of Service with cards covering agreements, account rules, and acceptable use. Primarily static content with UI components and styling.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking schema version, features, and pending requests related to updating the Landing Page 'Get Started' button behavior."
}