{
  "kind": "build_request",
  "title": "Use colorful original social icons with links and remove duplicate social icons at the bottom",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the only “Follow Us” social icon set in the UI is the existing footer social section (frontend/src/components/Footer.tsx) using SOCIAL_LINKS (frontend/src/constants/socialLinks.ts), and do not add or keep an additional social icon row at the bottom of the landing page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "No i just want to social Icons colorful original with links not to add all new at bottom"
        ]
      },
      "acceptanceCriteria": [
        "Landing page (frontend/src/pages/LandingPage.tsx) no longer renders its own separate “Follow Us” icon row in the Contact section.",
        "Footer remains the single source of social icons via SOCIAL_LINKS mapping.",
        "No other page introduces an additional, duplicate social icons row at the bottom of the page."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make the footer social icons appear as colorful, original/official full-color platform icons and ensure each icon click opens the correct outbound link behavior defined in frontend/src/constants/socialLinks.ts (including deep-link fallback behavior).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "social Icons colorful original with links"
        ]
      },
      "acceptanceCriteria": [
        "Footer “Follow Us” icons display as full-color (not monochrome) and are consistently sized/aligned.",
        "Each footer icon opens the exact URL defined in SOCIAL_LINKS; deep-link items attempt deep-link first and fall back to opening the web URL.",
        "All social icons in the footer are keyboard-focusable and have appropriate aria-labels (already provided by SOCIAL_LINKS)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove unused social-icon dependencies/imports from frontend/src/pages/LandingPage.tsx after removing the duplicated social icons section (e.g., react-icons imports) to keep the bundle clean.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "not to add all new at bottom"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/pages/LandingPage.tsx no longer imports unused social icon components (e.g., SiFacebook/SiInstagram/SiLinkedin/SiYoutube) if they are not rendered anywhere in that page.",
        "The frontend builds without lint/type errors related to unused imports."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (immutable paths).",
    "Keep social link URLs and behaviors defined in frontend/src/constants/socialLinks.ts as the source of truth for footer social navigation."
  ],
  "nonGoals": [
    "Adding new social platforms beyond the existing set in SOCIAL_LINKS.",
    "Changing backend logic or storing social links in the backend."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}