{
  "kind": "build_request",
  "title": "Remove header Login button and make Get Started open Google Form",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the Login feature button from the UI so that unauthenticated users no longer see a \"Login\" button in the header.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove login feature button"
        ]
      },
      "acceptanceCriteria": [
        "When the user is not authenticated, the header does not render any button or menu item labeled \"Login\".",
        "Authenticated users can still log out via the existing user dropdown (\"Logout\").",
        "No other header navigation elements (Home/About/Services/Contact and mobile sheet) are removed or broken."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Landing Page hero section \"Get Started\" button so that tapping/clicking it opens this URL in a new browser tab/window: https://docs.google.com/forms/d/e/1FAIpQLSfPd7k1jiJqI71faIie9aYOmeScqdQ98jTcIFtYoJK9AJvHig/viewform?usp=preview, and it must not trigger the Internet Identity login flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Get Started button link to https://docs.google.com/forms/d/e/1FAIpQLSfPd7k1jiJqI71faIie9aYOmeScqdQ98jTcIFtYoJK9AJvHig/viewform?usp=preview whenever touch on it."
        ]
      },
      "acceptanceCriteria": [
        "Clicking/tapping the hero \"Get Started\" button opens the provided Google Forms URL in a new tab/window.",
        "Clicking/tapping the hero \"Get Started\" button does not call the Internet Identity login flow and does not change authentication state.",
        "The Landing Page still renders without React/TypeScript warnings or errors (e.g., no unused variables after removing/changing the login handler)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not modify the read-only Internet Identity hooks in frontend/src/hooks/useInternetIdentity.ts / .tsx and frontend/src/hooks/useActor.ts."
  ],
  "nonGoals": [
    "Do not remove or change backend authentication, authorization, or data models.",
    "Do not implement a new authentication provider; only UI behavior changes are required.",
    "Do not change the WhatsApp button, footer links, or other marketing section content unless required to fulfill the button/link changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}