{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Deduplicate social icons and ensure full-color footer social links with correct behaviors",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove the LandingPage “Follow Us” icon row so the Footer remains the only social icon set, sourced from SOCIAL_LINKS.",
      "acceptanceCriteria": [
        "Landing page (frontend/src/pages/LandingPage.tsx) no longer renders its own separate “Follow Us” icon row in the Contact section.",
        "Footer remains the single source of social icons via SOCIAL_LINKS mapping.",
        "No other page introduces an additional, duplicate social icons row at the bottom of the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Remove the duplicated Contact-section “Follow Us” social icon row (currently hardcoded with social image links) so the app relies only on the footer’s social section (frontend/src/components/Footer.tsx) driven by SOCIAL_LINKS (frontend/src/constants/socialLinks.ts)."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Confirm the footer remains present as the single UI location that renders the “Follow Us” social icon set via SOCIAL_LINKS mapping; do not add any additional social rows elsewhere."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure footer social icons use full-color official icon assets and clicking follows SOCIAL_LINKS behavior (including deep-link fallback), with accessible focus/labels.",
      "acceptanceCriteria": [
        "Footer “Follow Us” icons display as full-color (not monochrome) and are consistently sized/aligned.",
        "Each footer icon opens the exact URL defined in SOCIAL_LINKS; deep-link items attempt deep-link first and fall back to opening the web URL.",
        "All social icons in the footer are keyboard-focusable and have appropriate aria-labels (already provided by SOCIAL_LINKS)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/constants/socialLinks.ts",
          "operation": "modify",
          "description": "Ensure SOCIAL_LINKS continues to be the source of truth for footer social navigation and that each item points to the full-color official icon assets located at: frontend/public/assets/generated/social-linkedin-fullcolor.dim_64x64.png, frontend/public/assets/generated/social-facebook-fullcolor.dim_64x64.png, frontend/public/assets/generated/social-instagram-fullcolor.dim_64x64.png, frontend/public/assets/generated/social-youtube-fullcolor.dim_64x64.png, frontend/public/assets/generated/social-whatsapp-fullcolor.dim_64x64.png. Keep deep-link + fallback metadata here."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update footer social icon rendering to guarantee consistent sizing/alignment for the full-color icon images sourced from SOCIAL_LINKS and to enforce correct outbound behavior: direct links open in a new tab; deep-link items attempt deep link first and then open the mapped web URL. Ensure anchors remain keyboard-focusable and keep aria-label sourced from SOCIAL_LINKS."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Clean up unused social icon imports/dependencies from LandingPage after removing the duplicated social icons row.",
      "acceptanceCriteria": [
        "frontend/src/pages/LandingPage.tsx no longer imports unused social icon components (e.g., SiFacebook/SiInstagram/SiLinkedin/SiYoutube) if they are not rendered anywhere in that page.",
        "The frontend builds without lint/type errors related to unused imports."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Remove now-unused social icon imports (e.g., SiFacebook/SiInstagram/SiLinkedin/SiYoutube) and any other unused imports left after deleting the duplicated “Follow Us” block, keeping only what is still rendered (e.g., keep SiWhatsapp only if still used by the WhatsApp contact card)."
        }
      ]
    }
  ]
}